# SupportCheckDone Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..SupportCheckDone Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Member support check is complete. No unsupported elements detected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SupportCheckDone { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SupportCheckDone As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SupportCheckDone {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace